//　スマートキャスト
/*
 * スマートキャストとは型のチェックをすることで自動的かつ安全にキャストする機能
 * スマートキャストが適用されると明示的なキャストを使用する必要がない
 * オブジェクトがインターフェースや型の定義を含んでいるか確認するには、isを用いる
 * 強制的にキャストする場合はasを利用する
 * キャストに失敗するとClassCastException例外が発生するが、
 * スマートキャストは型安全であるため強制的なキャストが不要になる
 */
fun main(){
    val x : Any = 42
    if (x is Int){ // isでIntであるかチェック
        // Int.toString(radix) を使用すると、数値 (Int) を任意の基数の文字列表現に変換することができる
        println(x.toString(radix = 2)) // スマートキャストでIntと認識され、101010と表示される
    }

    if (x is Int) {
        val s = x as Int // スマートキャストによって、asでキャストする必要がない
        println(s.toString(radix = 2))
    }
}

